person 16077
a 12668
the 8374
on 3037
is 2356
in 1761
door 1660
of 1357
they 1249
opens 1203
their 1200
takes 1141
puts 1089
to 941
from 936
out 823
eating 820
light 787
glass 773
off 702
holding 701
into 700
down 694
book 630
shoes 583
closes 579
bag 577
table 577
food 567
some 553
sandwich 549
chair 548
box 541
cabinet 536
laptop 523
at 522
window 498
cup 483
it 478
sits 461
put 459
turns 448
sitting 446
runs 446
shelf 435
up 435
phone 429
putting 426
room 423
clothes 423
floor 410
pillow 400
sneezing 392
open 392
water 389
take 383
throws 373
doorway 362
with 356
drinking 345
closet 343
opening 339
walks 339
another 337
picture 320
starts 318
bed 316
refrigerator 310
blanket 308
smiling 306
through 302
begins 284
laughing 283
towel 276
eats 259
something 253
coffee 248
undressing 240
one 240
closing 237
cooking 227
start 221
drink 221
close 212
begin 196
stove 193
broom 192
drinks 187
them 184
eat 184
medicine 179
throwing 178
running 176
camera 173
sofa 168
watching 166
pours 165
away 164
mirror 161
stand 159
couch 156
kitchen 156
television 154
turn 153
awakens 152
looks 152
dishes 148
by 146
onto 140
bathroom 137
back 136
looking 136
as 136
sink 133
washing 132
groceries 131
dressing 126
sit 116
bottle 116
desk 113
bedroom 110
behind 108
stairs 108
standing 107
playing 99
look 99
turning 98
are 98
throw 97
hands 96
pouring 94
reading 92
pantry 92
front 89
was 84
his 83
laughs 81
hallway 80
walking 78
themselves 77
tidying 76
that 75
opened 74
hair 74
fixing 74
washes 73
over 72
awakening 71
garage 69
plate 69
doorknob 66
snuggling 62
he 61
around 61
talking 61
run 61
holds 60
working 59
an 58
inside 58
seen 57
entryway 56
living 56
laundry 56
other 56
next 55
pair 55
pour 55
this 54
walk 52
man 50
dressed 49
undresses 48
stands 47
closed 47
lights 46
dish 45
vacuum 44
counter 44
gets 44
under 44
for 43
snack 42
fixes 41
bite 41
wardrobe 40
dining 39
top 39
doors 39
watches 38
undress 38
jacket 37
laugh 36
homework 35
wash 35
wall 35
machine 34
get 34
lying 34
second 33
hand 33
chips 32
washer 31
, 31
turned 31
taking 31
same 31
basement 30
dryer 30
laying 30
outside 29
there 29
pocket 28
nearby 28
also 27
books 27
small 26
office 26
goes 26
soda 26
proceeds 26
watch 26
place 26
grabs 25
getting 25
or 24
read 24
fix 24
someone 24
finally 24
two 24
towards 24
snuggles 23
lies 23
enters 23
near 23
fridge 22
switch 22
ground 22
corner 22
reads 22
bowl 21
tidy 21
home 20
milk 20
started 20
dresses 20
hall 20
grab 20
go 20
computer 19
when 19
game 19
work 19
again 19
recreation 19
lays 18
screen 18
began 18
few 18
comes 18
tv 18
plays 17
house 17
leave 17
cupboard 17
cook 17
cell 17
video 17
pictures 17
head 17
play 16
quickly 16
items 16
pile 16
times 16
so 16
her 16
who 16
paper 16
both 15
across 15
more 15
cooks 15
cookie 15
smiles 15
things 15
juice 15
undressed 14
after 14
pot 14
people 14
cabinets 14
plastic 14
woman 13
leaves 13
first 13
than 13
piece 13
sweater 13
snuggle 13
pillows 13
picks 13
stops 13
grasping 12
toilet 12
dress 12
him 12
b 12
carrying 12
pick 12
dirty 12
aside 12
continues 12
themself 12
using 12
shoe 11
can 11
pan 11
toward 11
hold 11
bags 11
sip 11
leaving 11
papers 11
girl 11
dresser 10
towels 10
looked 10
clothing 10
wrapped 10
item 10
doing 10
wearing 10
apple 10
talks 10
she 10
where 10
all 9
sat 9
awaken 9
boxes 9
talk 9
which 9
decides 9
way 9
study 9
suddenly 9
multiple 9
seated 9
flashlight 9
notebook 8
past 8
wine 8
self 8
what 8
time 8
removes 8
against 8
shirt 8
were 8
be 8
cereal 8
different 8
glasses 8
cups 8
repeatedly 8
shoulder 8
works 7
walked 7
stuff 7
continue 7
garbage 7
side 7
wards 7
taken 7
stack 7
because 7
container 7
uses 7
still 7
moment 7
cellphone 7
trying 7
several 7
large 7
use 6
feet 6
detergent 6
beside 6
each 6
folding 6
folded 6
contents 6
tries 6
hamper 6
grocery 6
have 6
mug 6
rack 6
took 6
does 6
beverage 6
sneezes 6
couple 6
cookies 6
candy 6
twice 6
lap 6
lightbulb 6
bottom 6
above 6
red 6
slowly 6
hanging 6
finish 6
himself 6
just 6
tissue 6
blankets 6
oven 6
stop 5
#1 5
flips 5
but 5
blinds 5
beginning 5
nightstand 5
poured 5
sneeze 5
try 5
reaches 5
being 5
steps 5
make 5
shower 5
moves 5
smile 5
lid 5
seat 5
nap 5
appears 5
trash 5
shutting 5
pull 5
dust 5
done 5
beer 5
cave 5
games 5
tea 5
neck 5
removing 5
liquid 5
drawer 5
right 5
somewhere 5
breakfast 5
lot 5
shuts 5
covered 5
very 5
manner 5
guy 4
foot 4
keeps 4
places 4
#2 4
later 4
car 4
well 4
cloth 4
grasps 4
staircase 4
young 4
about 4
though 4
potato 4
empty 4
washed 4
show 4
air 4
has 4
lunch 4
proceed 4
full 4
curtain 4
bit 4
frame 4
& 4
see 4
finishing 4
shelves 4
thermos 4
decide 4
iced 4
its 4
between 4
2 4
circles 4
crackers 4
area 4
grasp 4
basket 4
little 4
clean 4
orange 4
then 4
pink 4
tennis 4
lied 4
left 4
instead 4
dinner 4
bulb 4
meal 4
arm 4
containing 4
backpack 4
jar 4
1 4
forth 4
bedside 4
got 4
tray 4
continuing 4
mobile 3
too 3
bench 3
bin 3
cleaner 3
enter 3
once 3
cleaning 3
fixed 3
reflection 3
remote 3
cuts 3
funny 3
whole 3
white 3
chest 3
seconds 3
slightly 3
hoodie 3
doorthe 3
hat 3
upon 3
whats 3
plates 3
together 3
hard 3
tissues 3
fruit 3
tool 3
immediately 3
face 3
coat 3
picking 3
fresh 3
various 3
reach 3
view 3
thing 3
selfie 3
pulls 3
underneath 3
bends 3
partially 3
program 3
dishwasher 3
while 3
starting 3
find 3
pause 3
flash 3
walkin 3
coke 3
found 3
come 3
old 3
knob 3
else 3
furiously 3
grabbing 3
new 3
pizza 3
entry 3
eggs 3
form 3
used 3
like 3
flip 3
circle 3
set 3
pajamas 3
bites 3
sweatshirt 3
soap 3
appear 2
below 2
load 2
jumps 2
cards 2
said 2
occasionally 2
carries 2
spoon 2
softly 2
page 2
writing 2
edge 2
rec 2
cracker 2
cardboard 2
move 2
bucket 2
encounters 2
boots 2
had 2
do 2
makes 2
snuggled 2
stair 2
o 2
big 2
angrily 2
entered 2
begings 2
uncontrollably 2
remove 2
tub 2
check 2
entering 2
picked 2
persons 2
prepares 2
closer 2
fit 2
i 2
sleeping 2
happy 2
lie 2
wrapper 2
periodically 2
bottles 2
proceeded 2
remember 2
sweeps 2
recreational 2
bright 2
pushes 2
awakened 2
reaching 2
keys 2
bread 2
persno 2
lay 2
laughed 2
exiting 2
pretends 2
objects 2
cap 2
not 2
sweeping 2
pass 2
kept 2
shoulders 2
brings 2
typing 2
let 2
cooked 2
bunch 2
curtains 2
middle 2
beneath 2
need 2
blue 2
finishes 2
happily 2
chairs 2
remains 2
sees 2
kind 2
loaded 2
briefly 2
windows 2
flight 2
falling 2
opend 2
napkin 2
kicking 2
carton 2
resumes 2
came 2
pen 2
legs 2
rest 2
moments 2
call 2
tapping 2
chocolate 2
pitcher 2
wakes 2
dusty 2
sandwhich 2
ceiling 2
shines 2
constantly 2
been 2
movie 2
comfortable 2
photo 2
sheet 2
intensely 2
seems 2
broken 2
flicks 2
bowls 2
magazine 2
watched 2
drawers 2
leg 2
ledge 2
switches 2
selfies 2
laughter 2
stood 2
heat 2
s 2
winter 2
sort 2
wooden 2
tried 2
if 2
process 2
sleep 2
leading 2
lightswitch 2
position 2
fork 2
maker 2
individual 2
adjusts 2
handle 2
socks 2
banana 2
toy 2
eventually 2
personal 1
sudden 1
swallowing 1
freshly 1
cleaned 1
debating 1
soup 1
seats 1
smiled 1
vegins 1
touchscreen 1
clothesline 1
placed 1
shutters 1
heads 1
supplies 1
approached 1
redressed 1
package 1
intently 1
straightens 1
meat 1
stretch 1
bend 1
unlace 1
switched 1
and 1
daughter 1
burrito 1
high 1
theirself 1
black 1
drop 1
making 1
messily 1
movement 1
antiacids 1
groom 1
pretending 1
x 1
exit 1
closses 1
fluffy 1
thier 1
dancing 1
ant 1
wipe 1
sweat 1
forehead 1
smilingthe 1
lamp 1
hot 1
calmly 1
appropriatley 1
part 1
frig 1
chosen 1
bow 1
packing 1
thrown 1
cola 1
sick 1
night 1
complaining 1
string 1
point 1
burntout 1
wake 1
cookbook 1
yellow 1
change 1
2nd 1
paperwork 1
aa 1
really 1
kleenex 1
dusts 1
comfort 1
tap 1
3 1
reopen 1
dosage 1
tidys 1
canvas 1
spot 1
boxed 1
base 1
stairway 1
dirt 1
clothe 1
stir 1
screwdriver 1
changing 1
properly 1
flings 1
bursts 1
half 1
eaten 1
unidentified 1
liquids 1
smartphone 1
downstairs 1
foodthe 1
hinge 1
storage 1
sill 1
warmer 1
coatrack 1
drying 1
misses 1
adjusting 1
pans 1
threw 1
draped 1
snacks 1
int 1
ear 1
will 1
stray 1
win 1
sneezingthe 1
pillowthe 1
child 1
beings 1
fruits 1
lookin 1
notebooks 1
linen 1
comic 1
chip 1
hug 1
heartily 1
pop 1
dog 1
beans 1
randomly 1
knife 1
violently 1
causes 1
before 1
isdrinking 1
baggy 1
dim 1
hysterically 1
bent 1
remembers 1
eye 1
level 1
thoughtfully 1
teh 1
awhile 1
older 1
stairwell 1
rush 1
purse 1
boo 1
doorwaywhile 1
pill 1
shot 1
warmly 1
serve 1
think 1
wiping 1
cocoa 1
stars 1
end 1
mashine 1
pauses 1
stirs 1
pepper 1
cookingon 1
dumps 1
mirrored 1
reveal 1
going 1
replace 1
doen 1
points 1
bookbag 1
bedroomthey 1
examining 1
collects 1
awoke 1
moved 1
nearest 1
shirtless 1
asleep 1
rampant 1
sneezed 1
carpet 1
clothesthe 1
boxthe 1
swinging 1
donut 1
original 1
evening 1
news 1
visible 1
crouches 1
unhealthy 1
products 1
tidily 1
bending 1
squeaky 1
everywhere 1
step 1
cuddles 1
cupthe 1
brew 1
followed 1
last 1
alot 1
morning 1
workbench 1
sheets 1
videos 1
lighting 1
directed 1
cabitnet 1
adjust 1
shaking 1
additional 1
wet 1
struggles 1
struggling 1
confused 1
sandwiches 1
own 1
nonstop 1
larger 1
nest 1
ishoes 1
cloths 1
continuously 1
conversation 1
having 1
humorous 1
woken 1
theirselves 1
they've 1
brightly 1
favorite 1
elbow 1
lifts 1
break 1
flipping 1
shut 1
refrigerators 1
checking 1
spices 1
thick 1
message 1
slid 1
consuming 1
atop 1
dry 1
posing 1
three 1
framed 1
halfeaten 1
words 1
due 1
loud 1
noise 1
only 1
cheese 1
gestures 1
touches 1
ornament 1
excitedly 1
foldup 1
twirls 1
no 1
purpose 1
checks 1
recipe 1
decided 1
absurdity 1
situation 1
needs 1
reacts 1
entrance 1
skillet 1
grape 1
bought 1
many 1
tablet 1
railing 1
apartment 1
personlaying 1
mountain 1
dew 1
loads 1
vanity 1
leaning 1
third 1
attempt 1
gently 1
waiting 1
abruptly 1
references 1
creepy 1
held 1
deciding 1
hugging 1
shoves 1
balanced 1
bedtime 1
along 1
jug 1
hurriedly 1
kid 1
setting 1
cover 1
ans 1
fingers 1
folds 1
ina 1
flicking 1
laughingthe 1
runnings 1
reenter 1
dough 1
touch 1
belongs 1
device 1
recloses 1
ended 1
driveway 1
tossing 1
bagged 1
short 1
puzzle 1
pulling 1
hey 1
prepare 1
photograph 1
hits 1
sponge 1
itand 1
rather 1
microwave 1
rice 1
packet 1
board 1
curtained 1
follow 1
attempting 1
doorways 1
shirts 1
envelope 1
how 1
silly 1
seem 1
faucet 1
completing 1
removed 1
boy 1
grabbed 1
worn 1
ritz 1
won't 1
hide 1
frantically 1
redress 1
tosses 1
during 1
returns 1
th 1
edoorknob 1
unto 1
uncontrollable 1
rage 1
muffin 1
inspection 1
gear 1
gives 1
positioning 1
texting 1
stare 1
doorwaythe 1
earlier 1
replaces 1
flipped 1
momentarily 1
lastly 1
searched 1
rings 1
casual 1
doorsthe 1
curious 1
repeats 1
until 1
finished 1
entertainment 1
center 1
sanitizer 1
rod 1
residence 1
kneeling 1
outdoor 1
leftovers 1
takeout 1
knees 1
lean 1
animal 1
climbs 1
panini 1
object 1
palce 1
timed 1
pie 1
brown 1
taping 1
outy 1
wood 1
simultaneously 1
interrupted 1
must 1
fixture 1
stretching 1
arms 1
jiggles 1
messy 1
unknown 1
batteries 1
loose 1
friend 1
weather 1
sliding 1
laptops 1
pages 1
clicks 1
blind 1
exits 1
rises 1
occasional 1
seating 1
wrap 1
long 1
somewhat 1
irresponsible 1
shortly 1
pretend 1
keep 1
mouth 1
deep 1
decompressing 1
minutes 1
kick 1
mini 1
disposable 1
overhead 1
those 1
kicks 1
roll 1
bagel 1
adn 1
llooked 1
ferociously 1
now 1
adjacent 1
played 1
review 1
junk 1
moving 1
relaxed 1
frying 1
forward 1
oin 1
lending 1
tables 1
peeling 1
others 1
unwraps 1
persin 1
stopping 1
seeing 1
succession 1
strainer 1
probably 1
profusely 1
notepad 1
soft 1
went 1
ran 1
pills 1
casually 1
spoonful 1
made 1
leads 1
mischievous 1
striped 1
pants 1
types 1
keyboard 1
bring 1
tilt 1
entire 1
love 1
teenager 1
cat 1
inches 1
siting 1
reopens 1
drank 1
racks 1
adding 1
semireclining 1
carefully 1
lollipop 1
trun 1
photos 1
organizes 1
china 1
herself 1
cans 1
crouching 1
atart 1
propped 1
appearing 1
armoire 1
vacuuming 1
plugged 1
slumber 1
burger 1
case 1
background 1
often 1
cold 1
baby 1
jumper 1
pieces 1
sets 1
